---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricWireDiameter
source: html/d1ef2ca7-2a63-de76-0011-22569f031018.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricWireDiameter Property

"Nominal Diameter": Nominal Diameter of Fabric Wire.

## Syntax (C#)
```csharp
public static ForgeTypeId FabricWireDiameter { get; }
```